Repository: avlispedro/ruby-br_bot
Catalog: po/*/rbot-translator.po
Languages: pt_br

source: Cannot translate empty string
pt_br: Não posso traduzir uma string vazia

source: Number of seconds to wait for the translation service before timeout
pt_br: Número de segundos pra esperar antes que o serviço de tradução esgote o tempo

source: Translator %{name} cannot be used: %{reason}
pt_br: Tradutor %{name} não pode ser usado: %{reason}

source: List of translators to try in order when translator name not specified
pt_br: Lista de tradutores para tentar em ordem quando o nome do tradutor não for específicado

source: %{translator} <from> <to> <phrase> => Look up phrase using %{info}, supported from -> to languages: %{directions}
pt_br: %{translator} <from> <to> <phrase> => Procurar por frase usando %{info}, linguagens suportadas from -> to: %{directions}

source: Command: <translator> <from> <to> <phrase>, where <translator> is one of: %{translators}. If "translator" is used in place of the translator name, the first translator in translator.default_list which supports the specified direction will be picked automatically. Use "help <translator>" to look up supported from and to languages
pt_br: Comando: <translator> <de> <para> <frase>, aonde <translator> é um dos: %{translators}. Se \"translator\" é usado no lugar do nome do tradutor, o primeiro tradutor em translator.default_list que suporta a direção específicada vai ser pega automaticamente. Use \"help <translator>\" para olhar as linguagens de e para suportadas

source: None of the default translators (translator.default_list) supports translating from %{source} to %{target}
pt_br: Nenhum dos tradutores padrão (translator.default_list) suporta traduzir de %{source} para %{target}

source: %{translation} (provided by %{translator})
pt_br: %{translation} (elaborada por %{translator}

source: %{translator} doesn't support translating from %{source} to %{target}
pt_br: %{translator} não suporta traduzir de %{source} para %{target}

source: %{translator} failed to provide a translation
pt_br: %{translator} falhou ao prover uma tradução

source: The translator timed out
pt_br: O tradutor esgotou o tempo

source: No translator called %{name}
pt_br: Não existe tradutor chamado %{name}
