Repository: avlispedro/ruby-br_bot
Catalog: po/*/rbot.po
Languages: pt_br

source: Password for the bot owner
pt_br: Senha para o dono do Bot

source: Set false to prevent new botusers from logging in without a password when the user netmask is known
pt_br: Ajuste como falso para prevenir novos usuários do bot logarem semuma senha quando a mascára de rede é conhecida

source: Set false to prevent new botusers from recognizing IRC users without a need to manually login
pt_br: Ajuste como falso para prevenir novos usuários do robô como usuários IRC sema necessidade de logar manualmente.

source: Set true to allow new botusers to be created automatically
pt_br: Ajuste como verdadeiro para permitir novos botusers serem criados automaticamente

source: %{user}, you don't have '%{command}' permissions here
pt_br: %{user}, você não tem autorização para executar '%{command}

source: %{desc} [valid values are: %{values}]
pt_br: %{desc} [valores válidos são: %{values}]

source: First time rbot configuration wizard
pt_br: Mágico de configuração do rbot pela primeira vez

source: This wizard will ask you a few questions to get you started.
pt_br: Esse mágico vai perguntar pra você algumas questões pra que você comece.

source: The rest of rbot's configuration can be manipulated via IRC once rbot is connected and you are auth'd.
pt_br: O resto da configuração do rbot pode ser manipulado pelo IRC quando o rbotestiver conectado e você estiver autenticado

source: please do not use + or - in front of command %{command} when resetting
pt_br: por favor não use + ou - na frente do comando %{command} quando resetar

source: + or - expected in front of %{string}
pt_br: + ou - esperado na frente de %{string}

source: '%{string}' doesn't look like a channel name
pt_br: '%{string}' não parece um nome de canal

source: trailing comma
pt_br: virgula acompanhando

source: you probably forgot a comma
pt_br: você provavelmente esqueceu uma vírgula

source: couldn't find botuser %{name}
pt_br: Não consegui achar botuser %{name}

source: you can't change permissions for %{username}
pt_br: você não pode mudar as permissões do %{username}

source: couldn't satisfy your request: %{errors}
pt_br: não pude satisfazer seu pedido: %{errors}

source: you are owner, you can do anything
pt_br: você é dono, você pode fazer qualquer coisa

source: owner can do anything
pt_br: dono pode fazer qualquer coisa

source: on any channel:
pt_br: em qualquer canal:

source: in private:
pt_br: em private:

source: no permissions set for %{user}
pt_br: sem permissões ajustadas para %{user}

source: permissions for %{user}:: %{permissions}
pt_br: permissões para %{user}:: %{permissions}

source: . only %{max} will be shown
pt_br: . apenas o %{max} vai ser mostrado

source: %{count} commands found matching %{pattern}%{extra}
pt_br: %{count} comandos encontrados que casam com %{pattern}%{extra}

source: %{user} can already do that
pt_br: %{user} já pode fazer isso

source: %{user} can't do that already
pt_br: %{user} não pode fazer isso ainda

source: sorry, %{cmd} doesn't look like a valid command. maybe you misspelled it, or you need to specify it should be in private?
pt_br: desculpe, %{cmd} não se parece com um comando válido. Talvez você fez um errode sintaxe, ou você precisa específicar que ele deve ser em private?

source: welcome, %{user}
pt_br: bem vindo, %{user}

source: sorry, can't do
pt_br: desculpe, não pode ser

source: couldn't login: %{exception}
pt_br: não pode logar-se: %{exception}

source: I couldn't find anything to let you login automatically
pt_br: Eu não consegui achar nada pra deixar você logar automaticamente

source: you are %{who}
pt_br: você é %{who}!

source: no one that I know
pt_br: ninguém que eu conheça

source: my boss
pt_br: meu chefe

source: login [<botuser>] [<pass>]: logs in to the bot as botuser <botuser> with password <pass>. When using the full form, you must contact the bot in private. <pass> can be omitted if <botuser> allows login-by-mask and your netmask is among the known ones. if <botuser> is omitted too autologin will be attempted
pt_br: login [<botuser>] [<senha>]: loga no bot como botuser <botuser> com senha<senha>. Quando usar a forma inteira, você deve contatar o bot em private.<senha> pode ser omitida se <botuser> permite login-by-mask e sua mascara derede está entre os nomes conhecidos. Se <botuser> for omitido também autologinvai ser tentado.

source: whoami: names the botuser you're linked to
pt_br: whoami: nomeia o botuser que você está ligado.

source: who is <user>: names the botuser <user> is linked to
pt_br: who is <usuário>: fala o nome que o botuser do <usuário> está ligado

source: a permission is specified as module::path::to::cmd; when you want to enable it, prefix it with +; when you want to disable it, prefix it with -; when using the +reset+ command, do not use any prefix
pt_br: uma permissão é específicada como module::path::to::cmd; quando você querativar, prefixe-a com +; quando quiser desativar, prefixe-a com -; quandousar o comando +reset+, não use nenhum prefixo

source: permissions [re]set <permission> [in <channel>] for <user>: sets or resets the permissions for botuser <user> in channel <channel> (use ? to change the permissions for private addressing)
pt_br: permissões [re]set <permission> [em <canal>] para <usuário>: ajusta ou reajustaas permissões para botuser <usuário> no canal <canal> (use ? para mudar aspermissões para endereçagem em private

source: permissions view [for <user>]: display the permissions for user <user>
pt_br: permissions view [para <usuário>]: mostra as permissões para usuário <user>

source: permissions search <pattern>: display the permissions associated with the commands matching <pattern>
pt_br: permissions search <padrão>: mostra as permissões associadas com os comandosque casam com <padrão>

source: user show <what> : shows info about the user; <what> can be any of autologin, login-by-mask, netmasks
pt_br: user show <oque> : mostra informações sobre usuário; <oque> pode serqualquer dos autologin, login-by-mask, netmasks

source: user enable|disable <what> : turns on or off <what> (autologin, login-by-mask)
pt_br: user enable|disable <oque>: liga ou desliga <oque> (autologin, login-by-mask)

source: user set password <blah> : sets the user password to <blah>; passwords can only contain upper and lowercase letters and numbers, and must be at least 4 characters long
pt_br: user set password <blah> : ajusta a senha do usuário para <blah>; senhas podemconter apenas letras e números e precisam ser de no mínimo 4 caracteres

source: user add|rm netmask <mask> : adds/removes netmask <mask> from the list of netmasks known to the botuser you're linked to
pt_br: user add|rm netmask <mask> : adiciona/remove netmask <mask> da lista denetmasks conhecidas ao botuser que você está ligado

source: user reset <what> : resets <what> to the default values. <what> can be +netmasks+ (the list will be emptied), +autologin+ or +login-by-mask+ (will be reset to the default value) or +password+ (a new one will be generated and you'll be told in private)
pt_br: user reset <oque> : reajusta <oque> para os valores padrão. <oque> pode ser+netmask+ (a lista vai ser limpa), +autologin+ ou +login-by-mask+ (vai provalor padrão) ou +password+ (um novo vai ser gerado e você vai ser notificadoem private

source: user tell <who> the password for <botuser> : contacts <who> in private to tell him/her the password for <botuser>
pt_br: user tell <quem> the password for <botuser> : contacta <quem> em private para lhe dizera senha para <botuser>

source: user create <name> <password> : create botuser named <name> with password <password>. The password can be omitted, in which case a random one will be generated. The <name> should only contain alphanumeric characters and the underscore (_)
pt_br: user create <nome> <senha> : cria botuser com <nome> e <senha>. A senha pode ser omitida,no caso uma randômica vai ser gerada. O <nome> pode conter apenas caracteres alfanuméricose o underscore (_)

source: user list : lists all the botusers
pt_br: user list : lista todos botusers

source: user destroy <botuser> : destroys <botuser>. This function %{highlight}must%{highlight} be called in two steps. On the first call <botuser> is queued for destruction. On the second call, which must be in the form 'user confirm destroy <botuser>', the botuser will be destroyed. If you want to cancel the destruction, issue the command 'user cancel destroy <botuser>'
pt_br: user destroy <botuser> : destrói <botuser>. Esta função %{highlight}precisa%{highlight}ser chamada em dois passos. Na primeira chamada <botuser> é programado pra destruição.Na segunda, que tem de ser na forma 'user confirm destroy <botuser>', o botuser vai serdestruido. Se você quer cancelar a destruição, execute o comando 'user cancel destroy <botuser>'

source: auth <masterpassword>: log in as the bot owner; other commands: login, whoami, permissions syntax, permissions [re]set, permissions view, user, meet, hello, allow, prevent
pt_br: auth <senhamaster>: loga como o dono do bot; outros comandos: login,whoami, permissions syntax, permissions [re]set, permissions view,user, meet, hello, allow, prevent

source: meet <nick> [as <user>]: creates a bot user for nick, calling it user (defaults to the nick itself)
pt_br: meet <nick> [as <user>]: cria um bot user para nick, chamando ele <user>(por padrão é o próprio nick)

source: hello: creates a bot user for the person issuing the command
pt_br: hello: cria um botuser para a pessoa executando o comando

source: allow <user> to do <sample command> [<where>]: gives botuser <user> the permissions to execute a command such as the provided sample command (in private or in channel, according to the optional <where>)
pt_br: allow <user> to do <comando exemplo> [<aonde>]: dá ao botuser <user> apermissão para executar o comando <comando exemplo> (em private ou no canal,de acordo com o opcional <aonde>)

source: deny <user> from doing <sample command> [<where>]: removes from botuser <user> the permissions to execute a command such as the provided sample command (in private or in channel, according to the optional <where>)
pt_br: deny <user> from doing <comando exemplo> [<aonde]: remove do botuser<user> a permissão para executar um comando como o exemplo (em privateou no canal, de acordo com o opcional <aonde>)

source: sorry, I need more arguments to %{command}
pt_br: desculpe, eu preciso de mais argumentos para %{command}

source: I can only %{command} these: %{arguments}
pt_br: Eu posso apenas %{command}: %{arguments}

source: no such bot user %{user}
pt_br: não existe tal botuser %{user}

source: you can't mess with %{user}
pt_br: você não pode mexer com %{user}

source: you can't see the properties of %{user}
pt_br: você não pode ver as propriedades de %{user}

source: no way I'm telling you the master password!
pt_br: de forma alguma eu vou te dizer a senha master!

source: you can't ask for someone else's password
pt_br: você não pode perguntar pela senha de outros

source: c'mon, you can't be asking me seriously to tell you the password in public!
pt_br: por favor, você não pode me perguntar publicamente a sua senha!

source: the password for %{user} is %{password}
pt_br: a senha para %{user} é %{password}

source: can %{action}
pt_br: pode %{action}

source: can not %{action}
pt_br: não pode %{action}

source: knows no netmasks
pt_br: não conhece netmasks

source: knows %{netmasks}
pt_br: conhece %{netmasks}

source: you can't change the default user
pt_br: você não pode mudar o usuário padrão

source: you can't edit %{user}
pt_br: você não pode editar %{user}

source: I ignored %{things} because %{reason}
pt_br: Eu ignorei %{thing} por que %{reason}

source: I haven't changed anything
pt_br: Eu não mudei nada

source: is that a joke? setting the password in public?
pt_br: é uma piada? ajustar a senha em público?

source: the password for %{user} is now %{password}
pt_br: a senha para %{user} é agora %{password}

source: I can only add/remove netmasks. See +help user add+ for more instructions
pt_br: Eu posso apenas adicionar/remover netmasks. Veja +help user add+ para mais instruções

source: sorry, I don't know how to %{request}
pt_br: desculpa, eu não sei como %{request}

source: couldn't %{cmd}: %{exception}
pt_br: não pode %{cmd}: %{exception}

source: you are now registered as %{buname}. I created a random password for you : %{pass} and you can change it at any time by telling me 'user set password <password>' in private
pt_br: Você agora está registrado como %{buname}. Eu criei um password randômicopra você: %{pass} e você pode mudá-lo quando quiser me dizendo 'user set password<password>' em private

source: but I already know %{buname}
pt_br: mas eu já conheço %{buname}

source: I had problems meeting %{nick}: %{e}
pt_br: Eu tive problemas encontrando %{nick}: %{e}

source: couldn't find botuser %{user}
pt_br: não consegui achar botuser %{user}

source: I'm not telling the master password to anyone, pal
pt_br: Eu não vou dizer a senha master pra ninguém chegado.

source: the password for botuser %{user} is %{password}
pt_br: a senha para o botuser %{user} é %{password}

source: I told %{user} that %{message}
pt_br: Eu disse a %{user} que %{message}

source: are you nuts, creating a botuser with a publicly known password?
pt_br: você está maluca, criando um botuser com um password conhecido publicamente?

source: failed to create %{user}: %{exception}
pt_br: falha ao criar %{user}: %{exception}

source: created botuser %{user}
pt_br: criado botuser %{user}

source: (queued for destruction)
pt_br: (esperando por destruição)

source: I have no botusers other than the default ones
pt_br: Eu não tenho mais botusers além dos por padrão

source: You can't destroy %{user}
pt_br: Você não pode destruir %{user}

source: no such botuser %{user}
pt_br: não existe tal botuser %{user}

source: %{user} removed from the destruction queue
pt_br: %{user} foi removido da fila de destruição

source: %{user} was not queued for destruction
pt_br: %{user} não foi pra fila de destruição

source: %{user} already queued for destruction, use %{highlight}user confirm destroy %{user}%{highlight} to destroy it
pt_br: %{user} já está na fila de destruição, use %{highlight} user confirm destroy%{user}%{highlight} para destrui-lo

source: %{user} queued for destruction, use %{highlight}user confirm destroy %{user}%{highlight} to destroy it
pt_br: %{user} na fila para destruição,, use %{highlight} user confirm destroy%{user}%{highlight} para destrui-lo

source: %{user} is not queued for destruction yet
pt_br: %{user} não está na fila para destruição ainda

source: failed: %{exception}
pt_br: falha: %{exception}

source: botuser %{user} destroyed
pt_br: botuser %{user} destruido

source: please don't touch the default users
pt_br: por favor não toque os usuários padrão

source: no such botuser %{source}
pt_br: não existe botuser %{source}

source: botuser %{dest} exists already
pt_br: botuser %{dest} já existe

source: botuser %{source} copied to %{dest}
pt_br: botuser %{source} copiado para %{dest}

source: botuser %{source} renamed to %{dest}
pt_br: botuser %{source} renomeado para %{dest}

source: selecting data to export ...
pt_br: selecionando dados para exportar ...

source: preparing data for export ...
pt_br: preparando dados para exportar

source: failed to prepare data: %{exception}
pt_br: falha ao preparar dados: %{exception}

source: exporting to %{file} ...
pt_br: exportando para %{file} ...

source: failed to export users: %{exception}
pt_br: falha ao exportar usuários: %{exception}

source: done
pt_br: pronto

source: reading %{file} ...
pt_br: lendo %{file} ...

source: failed to import from: %{exception}
pt_br: falha ao importar de: %{exception}

source: selecting data to import ...
pt_br: selecionando dados para importar ...

source: parsing data from import ...
pt_br: filtrando dados da importação ...

source: failed to parse data: %{exception}
pt_br: falha ao filtrar dados: %{exception}

source: quit [<message>] => quit IRC with message <message>
pt_br: quit [<message>] => sair do IRC com mensagem <message>

source: restart => completely stop and restart the bot (including reconnect)
pt_br: restart => parar e reiniciar completamente o bot (incluindo reconexão)

source: part
pt_br: sair(part)

source: hide => part all channels
pt_br: hide => sair de todos os canais(part)

source: nick <nick> => attempt to change nick to <nick>
pt_br: nick <nick> => tentar mudar nick para <nick>

source: say <channel>|<nick> <message> => say <message> to <channel> or in private message to <nick>
pt_br: say <channel>|<nick> <message> => dizer <message> para <channel> ou em privatepara <nick>

source: action <channel>|<nick> <message> => does a /me <message> to <channel> or in private message to <nick>
pt_br: action <channel>|<nick> <message> => faz um /me <message> para <channel> ou emprivate para <nick>

source: quiet [in here|<channel>] => with no arguments, stop speaking in all channels, if "in here", stop speaking in this channel, or stop speaking in <channel>
pt_br: quiet [in here|<channel>] => sem argumentos, para de falar em todos os canais,se \"in here\", para de falar neste canal, ou para de falar no <channel>

source: talk [in here|<channel>] => with no arguments, resume speaking in all channels, if "in here", resume speaking in this channel, or resume speaking in <channel>
pt_br: talk [in here|<channel>] => sem argumentos, volta a falar em todos os canais,se \"in here\", volta a falar neste canal, ou volta a falar em <channel>

source: ping => replies with a pong
pt_br: ping => responde com um pong

source: mode <channel> <mode> <nicks> => set channel modes for <nicks> on <channel> to <mode>
pt_br: mode <canal> <modo> <nicks> => ajusta os modos do canal dos <nicks> no <canal>para <modo>

source: [%{secs} ago]
pt_br: [%{secs} atrás]

source: I'm a v. %{version}%{ago} rubybot%{copyright}%{url}
pt_br: Eu sou um v. %{version}%{ago} rubybot%{copyright}%{url}

source: no such module %{module}
pt_br: não existe tal modulo %{module}

source: no such config key %{key}
pt_br: não existe tal chave de configuração %{key}

source: no config key found matching %{r}
pt_br: não achei a chave de configuração que case com %{r}

source: possible keys: %{kl}
pt_br: chaves possíveis: %{kl}

source: this config change will take effect on the next restart
pt_br: Essa mudança de configuração vai ter efeito no próximo reínicio

source: this config change will take effect on the next rescan
pt_br: essa mudança de config vai ter efeito na próxima releitura

source: failed to set %{key}: %{error}
pt_br: falha ao setar %{key}: %{error}

source: config key %{key} is not an array
pt_br: config key %{key} não é uma array

source: failed to add %{value} to %{key}: %{error}
pt_br: falha ao adicionar %{value} para %{key}: %{error}

source: failed to remove %{value} from %{key}: %{error}
pt_br: falha ao remover %{value} de %{key}: %{error}

source: saving ...
pt_br: salvando ...

source: rescanning ...
pt_br: relendo ...

source: done. %{plugin_status}
pt_br: pronto. %{plugin_status}

source: config list => list configuration modules, config list <module> => list configuration keys for module <module>
pt_br: config list => lista os módulos de configuração, config list <module> => listaas chaves de configuração para o módulo <module>

source: config get <key> => get configuration value for key <key>
pt_br: config get <key> => pega o valor da configuração para chave <key>

source: reset key <key> to the default
pt_br: reset key <key> para o padrão

source: config set <key> <value> => set configuration value for key <key> to <value>
pt_br: config set <key> <value> => ajusta o valor da configuração da chave <key>para <value>

source: config desc <key> => describe what key <key> configures
pt_br: config desc <key> => descreve o que a chave <key> configura

source: config add <value> to <key> => add value <value> to key <key> if <key> is an array
pt_br: config add <value> to <key> => adicionar valor <value> da chave <key> se <key>é uma array

source: config rm <value> from <key> => remove value <value> from key <key> if <key> is an array
pt_br: config rm <value> from <key> => remover valor <value> da chave <key> se <key>for uma array

source: config module - bot configuration. usage: list, desc, get, set, unset, add, rm
pt_br: config module - configuração do bot. usage: list, desc, get, set, unset, add,rm

source: nick <newnick> => change the bot nick to <newnick>, if possible
pt_br: nick <newnick> => mudar o nick do bot para <newnick>, se possível

source: status => display some information on the bot's status
pt_br: status => mostrar alguma informação no status do bot

source: save => save current dynamic data and configuration
pt_br: save => salva os dados dinâmicos atuais e a configuração

source: rescan => reload modules and static facts
pt_br: rescan => recarrega modulos e facts

source: version => describes software version
pt_br: version => descreve a versão do software

source: no filters in group %{g}
pt_br: sem filtros no grupo %{g}

source: no known filters
pt_br: nenhum filtro conhecido

source: known filters:
pt_br: filtros conhecidos:

source: no known filter groups
pt_br: nenhum grupo de filtro conhecido

source: known filter groups:
pt_br: grupos de filtro conhecidos:

source: no filters match %{pat}
pt_br: nenhum filtro corresponde a %{pat}

source: filters matching %{pat}:
pt_br: filtros correspondendo %{pat}:

source: sorry, no %{key} data for %{user}
pt_br: desculpe, sem %{key} dado para %{user}

source: year
pt_br: ano

source: years
pt_br: anos

source: month
pt_br: mês

source: months
pt_br: meses

source: day
pt_br: dia

source: days
pt_br: dias

source: hour
pt_br: hora

source: hours
pt_br: horas

source: minute
pt_br: minuto

source: minutes
pt_br: minutos

source: second
pt_br: segundo

source: seconds
pt_br: segundos

source: and
pt_br: e

source: %{d} from now
pt_br: %{d} a partir de agora

source: %{d} ago
pt_br: %{d} atrás

source: on %{date}
pt_br: em %{date}

source: less than a minute
pt_br: menos de um minuto

source: %{m} minutes
pt_br: %{m} minutos

source: about one hour
pt_br: quase uma hora

source: %{m} hours
pt_br: %{m} horas

source: one day
pt_br: um dia

source: about one day
pt_br: quase um dia

source: %{m} days
pt_br: %{m} dias

source: help topics:
pt_br: help tópicos:

source: (help <topic> for more info)
pt_br: (help <topico> para mais informação)

source: no help for topic %{topic}
pt_br: sem ajuda para tópico %{topic}

source: Uptime %{up}, %{plug} plugins active, %{sent} lines sent, %{recv} received.
pt_br: Tempo ligado %{up}, %{plug} plugins ativos, %{sent} linhas enviadas, %{recv} recebidas.

source: incorrect usage, ask for help using '%{command}'
pt_br: uso incorreto, peça por ajuda usando '%{command}'

source: %{count} core module loaded
pt_br: %{count} módulo central carregado

source: %{count} core module: %{list}
pt_br: %{count} módulo central: %{list}

source: no core botmodules loaded
pt_br: nenhum botmodulo central carregado

source: %{count} plugin loaded
pt_br: %{count} plugin carregado

source: %{highlight}%{count} plugin ignored%{highlight}
pt_br: %{highlight}%{count} plugin ignorado%{highlight}

source: %{highlight}%{count} plugin ignored%{highlight}: use %{bold}%{command}%{bold} to see why
pt_br: %{highlight}%{count} plugin ignorado%{highlight}: use %{bold}%{command}%{bold} pra ver porquê

source: %{highlight}%{count} plugin failed to load%{highlight}
pt_br: %{highlight}%{count} plugin falhou ao carregar%{highlight}

source: %{highlight}%{count} plugin failed to load%{highlight}: use %{bold}%{command}%{bold} to see why
pt_br: %{highlight}%{count} plugin falhou ao carregar%{highlight}: use %{bold}%{command}%{bold} para ver o porquê

source: no plugins failed to load
pt_br: nenhum plugin falhou ao carregar
