Repository: avlispedro/ruby-br_bot
Catalog: po/*/rbot.po
Languages: pt_br

source: %{highlight}%{plugin}%{highlight} in %{dir} failed with error %{exception}: %{reason}
pt_br: %{highlight}%{plugin}%{highlight} em %{dir} falhou com erro %{exception}: %{reason}

source: at %{backtrace}
pt_br: em %{backtrace}

source: no plugins were ignored
pt_br: nenhum plugin foi ignorado

source: overruled by previous
pt_br: tomado conta pelo anterior

source: upgrading old-style (rbot 0.9.5 or earlier) plugin registry to new format
pt_br: upgrading velho estilo de registro do plugin(rbot 0.9.5 ou anterior) para novo formato

source: upgrading previous (rbot 0.9.9 or earlier) plugin registry to new split format
pt_br: upgrading antigo registro do plugin (rbot 0.9.9 ou anterior) para novo formato de corte

source: marshal recovery failed, trying default
pt_br: politica de recuperação falhou, tentando padrão
